spec/fixtures/vcr_cassettes/iss_net_1_0_cancelar_nfse.yml

---
http_interactions:
- request:
    method: post
    uri: http://www.issnetonline.com.br/webserviceabrasf/homologacao/servicos.asmx
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.issnetonline.com.br/webservice/nfd" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Body><CancelarNfse><xml><![CDATA[<?xml version="1.0" encoding="utf-8"?>
        <CancelarNfseEnvio xmlns="http://www.issnetonline.com.br/webserviceabrasf/vsd/servico_cancelar_nfse_envio.xsd" xmlns:tc="http://www.issnetonline.com.br/webserviceabrasf/vsd/tipos_complexos.xsd">
          <Pedido>
            <tc:InfPedidoCancelamento>
              <tc:IdentificacaoNfse>
                <tc:Numero>201400000000015</tc:Numero>
                <tc:Cnpj>14576582000163</tc:Cnpj>
                <tc:InscricaoMunicipal>124762</tc:InscricaoMunicipal>
                <tc:CodigoMunicipio>999</tc:CodigoMunicipio>
              </tc:IdentificacaoNfse>
              <tc:CodigoCancelamento>5</tc:CodigoCancelamento>
            </tc:InfPedidoCancelamento>
            <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
        <SignedInfo>
        <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
        <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
        <Reference>
        <Transforms>
        <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
        </Transforms>
        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
        <DigestValue>Ftom6vEZTN1W30epLoFPf2qBGsk=</DigestValue>
        </Reference>
        </SignedInfo>
        <SignatureValue>xvkBHMEMzN/5iieEKk2jk805dvwx3WG3AJLnxgA90sslOB+6YDxY3QUCPRIYXGIT
        Nn/1kruyg6qVExJ2vZR4EU00vt/BPrr6VwT5cGJLolOetScj9KqikI//ZpPaUhkZ
        bv5ONjwcYuqNUVHwBB03z9bpRv/QRhortt4TikcYNkQ=</SignatureValue>
        <KeyInfo>
        <X509Data>
        <X509Certificate>MIIC5jCCAk+gAwIBAgIJAMzd2iNeztRSMA0GCSqGSIb3DQEBCwUAMIGKMQswCQYD
        VQQGEwJCUjEZMBcGA1UECAwQRGlzdHJpdG8gRmVkZXJhbDERMA8GA1UEBwwIQnJh
        c2lsaWExDjAMBgNVBAoMBVJuZnNlMRkwFwYDVQQDDBBybmZzZS5naXRodWIuY29t
        MSIwIAYJKoZIhvcNAQkBFhNhaXRoZXJpb3NAZ21haWwuY29tMCAXDTE0MDcxMDEx
        MTMyOFoYDzIxMTQwNjE2MTExMzI4WjCBijELMAkGA1UEBhMCQlIxGTAXBgNVBAgM
        EERpc3RyaXRvIEZlZGVyYWwxETAPBgNVBAcMCEJyYXNpbGlhMQ4wDAYDVQQKDAVS
        bmZzZTEZMBcGA1UEAwwQcm5mc2UuZ2l0aHViLmNvbTEiMCAGCSqGSIb3DQEJARYT
        YWl0aGVyaW9zQGdtYWlsLmNvbTCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEA
        1cQuK7bqd2w3ZslKWABFQHe3bD43b6SxWbI58ZXwM4VAOHjXJrSe1Ai2Yvd982gW
        Ir9zjQf+CebzW7N/Es7maFQzFP9KlevRldUM8OTThJ6TEVvpLRgeIbgpRQ8bWKB0
        lp3i6AggqCIQT8Q+5HG1bZn+8vjD1ZQ0lCZmyMX85w0CAwEAAaNQME4wHQYDVR0O
        BBYEFGBEjuYDxQcIjemHCelvFmdD85cgMB8GA1UdIwQYMBaAFGBEjuYDxQcIjemH
        CelvFmdD85cgMAwGA1UdEwQFMAMBAf8wDQYJKoZIhvcNAQELBQADgYEA1QQ8UFQT
        UWRxR8sqmnguN+nQR6GtmDi6XCpgvP73TW68Em/lhdKjzP3RUy3Clw3qv+CV0ebI
        BdHlq5kw12fb2XBVsls+PFnD6yQq9M8fUlUOLe4qz7mAIHw4iBS7I28uvoFsAvqE
        1ePe8pdP1RFvBMVm5fpduWR0h+z083Ytwkk=</X509Certificate>
        </X509Data>
        </KeyInfo>
        </Signature>
          </Pedido>
        </CancelarNfseEnvio>
        ]]></xml></CancelarNfse></soap:Body></soap:Envelope>
    headers:
      Soapaction:
      - '"CancelarNfse"'
      Content-Type:
      - application/soap+xml;charset=UTF-8
      Content-Length:
      - '2813'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 17 Nov 2014 17:59:19 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      X-Aspnet-Version:
      - 2.0.50727
      Cache-Control:
      - private, max-age=0
      Content-Type:
      - application/soap+xml; charset=utf-8
      Content-Length:
      - '1193'
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\"
        xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><CancelarNfseResponse
        xmlns=\"http://www.issnetonline.com.br/webservice/nfd\"><CancelarNfseResult>&lt;?xml
        version=\"1.0\" encoding=\"utf-8\"?&gt;\r\n&lt;CancelarNfseResposta xmlns=\"http://www.issnetonline.com.br/webserviceabrasf/vsd/servico_cancelar_nfse_resposta.xsd\"&gt;\r\n
        \ &lt;ListaMensagemRetorno&gt;\r\n    &lt;MensagemRetorno&gt;\r\n      &lt;Codigo
        xmlns=\"http://www.issnetonline.com.br/webserviceabrasf/vsd/tipos_complexos.xsd\"&gt;E160&lt;/Codigo&gt;\r\n
        \     &lt;Mensagem xmlns=\"http://www.issnetonline.com.br/webserviceabrasf/vsd/tipos_complexos.xsd\"&gt;
        Arquivo enviado fora da estrutura do arquivo XML de entrada.&lt;/Mensagem&gt;\r\n
        \     &lt;Correcao xmlns=\"http://www.issnetonline.com.br/webserviceabrasf/vsd/tipos_complexos.xsd\"&gt;
        Envie um arquivo dentro do schema do arquivo XML de entrada.&lt;/Correcao&gt;\r\n
        \   &lt;/MensagemRetorno&gt;\r\n  &lt;/ListaMensagemRetorno&gt;\r\n&lt;/CancelarNfseResposta&gt;</CancelarNfseResult></CancelarNfseResponse></soap:Body></soap:Envelope>"
    http_version: 
  recorded_at: Mon, 17 Nov 2014 17:59:19 GMT
recorded_with: VCR 2.9.3
